---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireTypeSet.Insert(Autodesk.Revit.DB.Electrical.WireType)
source: html/68f2c7d1-2d52-7055-c3c5-a2194fbb32b9.htm
---
# Autodesk.Revit.DB.Electrical.WireTypeSet.Insert Method

Insert the specified wire type into the set.

## Syntax (C#)
```csharp
public virtual bool Insert(
	WireType item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.WireType`) - The wire type to be inserted into the set.

## Returns
Returns whether the wire type was inserted into the set.